#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
module.another_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/test-policy]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # module.another_iam_policy.aws_iam_policy.policy[0] will be destroyed
  # (because aws_iam_policy.policy is not in configuration)
  - resource "aws_iam_policy" "policy" {
      - arn              = "arn:aws:iam::381491846999:policy/test-policy" -> null
      - attachment_count = 0 -> null
      - description      = "My test policy, do not use." -> null
      - id               = "arn:aws:iam::381491846999:policy/test-policy" -> null
      - name             = "test-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAVRUVPT5LYGAQM2FY7" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Owner"     = "company-example"
          - "Terraform" = "true"
        } -> null
    }

  # module.my_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "My test policy, do not use."
      + id               = (known after apply)
      + name             = "test-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Owner"     = "company-example"
          + "Terraform" = "true"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ policy = "arn:aws:iam::381491846999:policy/test-policy" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/artifacts/plan-output.txt

To perform exactly these actions, run the following command to apply:
    tofu apply "/tmp/artifacts/plan-output.txt"

```

</details>

*Pusher: @johnf-staybull, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Setup WorkFlow`*